app/Controllers/Administrador.php

        public function eliminar($id) {

            $servidores = new UsuarioServerModel();
            $servidores->where('id_usuario', $id)->delete();

            $usuarios = new UsuarioModel();
            $usuarios->delete($id);
---
DELETE FROM `servidor`
WHERE `id_usuario` = '6'
DELETE FROM `usuarios`
WHERE `id` IN ('6')