app/Controllers/CrearCuenta.php

INSERT INTO `usuarios` (`nombre`, `nombreusuario`, `clave`, `correo`) VALUES ('Miguel', 'Miguelito', '$2y$12$jPezYM9IbDUSpR7mKDWFceGz.vDn7prNePisYikBjDLb999b87mzi', 'malacruz132@gmail.com')
---
        public function guardar() {
            $model = new UsuarioModel();

            $nombre         = $this->request->getPost('nombre');
            $nombreusuario  = $this->request->getPost('nombreusuario');
            $clave          = $this->request->getPost('clave');
            $correo         = $this->request->getPost('correo');

            $model->insert([
                'nombre'        => $nombre,
                'nombreusuario' => $nombreusuario,
                'clave'         => password_hash($clave, PASSWORD_DEFAULT),
                'correo'        => $correo,
            ]);