app/Controllers/Login.php

SELECT *
FROM `usuarios`
WHERE `nombreusuario` = 'miguel'
 LIMIT 1
---
public function verificar() {

    // MODIFICAR!!!!!
    $usuario  = $this->request->getPost('nombreusuario');
    $password = $this->request->getPost('clave');

    $model = new UsuarioModel();
    $datosUsuario = $model -> where('nombreusuario', $usuario)->first();